{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/12/08/hello-world/"},{"title":"Deployment on AWS","text":"For the experience of first use of AWS:Initialisation Register a new AWS account. Open the AWS calculator to make sure the services chosen are in free-tier. Start from creating application in the Elastic Beanstalk service. Continue to create a new environment. While waiting for its creating process, navigate to the RDS panel to create a new database, which is potentially a SQL Server database. Then, deploy it. Write down the endpoint, port, username and password. Open the SSMD on your computer, try to connect to the server with following settings: Engine endpoint,port username password Create a new database and populate your data into it. Write down the database name, and assemble the connection string in following format: Data Source=,;Initial Catalog=;User ID=;Password=; Configuration Navigate to the IAM panel. Create a new user and a new group, then download the credential file(.csv). Waiting for them to finish…. Open the environment which just finished creation, select the Configure panel on the left, select the Modify button of Network to generate an public IP address for it. Now, go to the VPC panel, select the Security Groups under the Security label. Select the default one and then choose the Actions -&gt; Editing Inbound rules. Change to All TCP, and add your IP in the Source. Host your website Now, install the AWS toolkit for .Net. Open the VS, load your workspace. Right click your project and then select the publish to the AWS. Click the profile button and then import from the csv file which was downloaded at step 6. Be aware of the region you choose, it do really matters. Select the environment and then deploy it. Now go to your environment, wait for its Health turning to green, and then you can open the URL to check if everything is perfect. Go to the EC2 Dashboard and choose your instance, write down the IPV4 Public address. Register a new domain…. Add the “www A” and “ A” to its DNS records. Now your can access your website by visiting your domain.","link":"/2019/12/08/Deployment-on-AWS/"}],"tags":[{"name":"AWS","slug":"AWS","link":"/tags/AWS/"},{"name":"Web Deployment","slug":"Web-Deployment","link":"/tags/Web-Deployment/"},{"name":"Hosting","slug":"Hosting","link":"/tags/Hosting/"},{"name":"Experience","slug":"Experience","link":"/tags/Experience/"}],"categories":[{"name":"AWS","slug":"AWS","link":"/categories/AWS/"},{"name":"Deployment","slug":"AWS/Deployment","link":"/categories/AWS/Deployment/"}]}